app/controllers/books_controller.rb

    def create
        @book = Book.new(book_params)
        if @book.save
            flash[:notice] = "successfully"
            redirect_to book_path(@book)
        else
            @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2021-10-14 09:25:33.792679"], ["updated_at", "2021-10-14 09:25:33.792679"]]
SELECT "books".* FROM "books"

    def update
        @book = Book.find(params[:id])
        if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "c"], ["updated_at", "2021-10-14 15:55:51.508153"], ["id", 13]]

    def destroy
        book = Book.find(params[:id])
        book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 16]]